UPDATE `creature_template` SET `subname` = 'Expert Blacksmith'        WHERE `entry` = 1383;  -- 斯纳尔 <专家级铁匠>
UPDATE `creature_template` SET `subname` = 'Journeyman Tailor'        WHERE `entry` = 2855;  -- 斯诺恩 <初级裁缝>
UPDATE `creature_template` SET `subname` = 'Journeyman Engineer'      WHERE `entry` = 2857;  -- 桑德 <初级工程师>
UPDATE `creature_template` SET `subname` = 'Expert Enchanter'         WHERE `entry` = 3345;  -- 古丹 <专家级附魔师>
UPDATE `creature_template` SET `subname` = 'Expert Alchemist'         WHERE `entry` = 3347;  -- 耶尔玛克 <专家级炼金师>
UPDATE `creature_template` SET `subname` = 'Artisan Blacksmith'       WHERE `entry` = 3355;  -- 萨鲁·钢怒 <大师级铁匠>
UPDATE `creature_template` SET `subname` = 'Expert Tailor'            WHERE `entry` = 3363;  -- 玛加尔 <专家级裁缝>
UPDATE `creature_template` SET `subname` = 'Expert Leatherworker'     WHERE `entry` = 3365;  -- 卡洛雷克 <专家级制皮师>
UPDATE `creature_template` SET `subname` = 'Expert Engineer'          WHERE `entry` = 3412;  -- 诺格 <专家级工程师>
UPDATE `creature_template` SET `subname` = 'Journeyman Leatherworker' WHERE `entry` = 5811;  -- 卡玛瑞 <初级制皮师>
UPDATE `creature_template` SET `subname` = 'Armor Crafter'            WHERE `entry` = 7230;  -- 莎伊斯·钢怒 <铠甲锻造师>
UPDATE `creature_template` SET `subname` = 'Weapon Crafter'           WHERE `entry` = 7231;  -- 克尔格鲁克·血斧 <武器锻造师>
UPDATE `creature_template` SET `subname` = 'Journeyman Blacksmith'    WHERE `entry` = 10266; -- 乌格索克 <初级铁匠>
UPDATE `creature_template` SET `subname` = 'Artisan Engineer'         WHERE `entry` = 11017; -- 罗克希克 <大师级工程师>
UPDATE `creature_template` SET `subname` = 'Journeyman Alchemist'     WHERE `entry` = 11046; -- 伍特 <初级炼金师>
UPDATE `creature_template` SET `subname` = 'Journeyman Enchanter'     WHERE `entry` = 11066; -- 夏格 <初级附魔师>

UPDATE `creature_template` SET `npcflag` = 81 WHERE `entry` IN (1383, 2855, 2857, 3412, 5811, 10266, 11017, 11046, 11066); -- 训练师类型 = 2
UPDATE `creature_template` SET `type_flags` = 134217728 WHERE `entry` IN (1383, 3412, 11017);

DELETE FROM `conditions` WHERE `SourceTypeOrReferenceId` = 15 AND `SourceEntry` = 0 AND `ConditionTypeOrReference` = 7 AND `SourceGroup` IN (1012, 2782, 4126, 4148, 4151, 4168, 4209, 4347);
REPLACE INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `ConditionTypeOrReference`, `ConditionValue1`, `ConditionValue2`, `Comment`) VALUES
(15, 1012, 0, 7, 164, 125, '锻造技能达到125及以上时显示菜单'), -- 萨鲁·钢怒 <大师级铁匠>
(15, 2782, 0, 7, 164, 50,  '锻造技能达到50及以上时显示菜单'),  -- 斯纳尔 <专家级铁匠>
(15, 4126, 0, 7, 171, 50,  '炼金术技能达到50及以上时显示菜单'),        -- 耶尔玛克 <专家级炼金师>
(15, 4148, 0, 7, 202, 50,  '工程学技能达到50及以上时显示菜单'),    -- 诺格 <专家级工程师>
(15, 4151, 0, 7, 202, 125, '工程学技能达到125及以上时显示菜单'),   -- 罗克希克 <大师级工程师>
(15, 4168, 0, 7, 333, 50,  '附魔技能达到50及以上时显示菜单'),     -- 古丹 <专家级附魔师>
(15, 4209, 0, 7, 165, 50,  '制皮技能达到50及以上时显示菜单'), -- 卡洛雷克 <专家级制皮师>
(15, 4347, 0, 7, 197, 50,  '裁缝技能达到50及以上时显示菜单');      -- 玛加尔 <专家级裁缝>

DELETE FROM `creature` WHERE `id` = 3230 AND `map`= 1;
DELETE FROM `creature` WHERE `guid` IN (10299, 203492, 203493, 203494, 203495);
DELETE FROM `creature` WHERE `id` IN (3890, 14720, 14942, 15006);
REPLACE INTO `creature` (`guid`, `id`, `map`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`) VALUES
(603230, 3230,  1, 1, 1938.55, -4133.22, 41.1424, 4.07636, 300), -- 纳兹格雷尔 <萨尔的顾问>
(10299,  3296,  1, 1, 1620.45, -4252.84, 47.5273, 3.7001,  300), -- 奥格瑞玛步兵
(603890, 3890,  1, 1, 1991.89, -4793.95, 56.0462, 3.27581, 300), -- 布拉古尔·死亡使者 <战歌峡谷战场军官>
(614720, 14720, 1, 1, 1565.79, -4395.27, 6.9866, 3.35103,  600), -- 萨鲁法尔大王
(614942, 14942, 1, 1, 1980.9, -4787.78, 55.8796, 5.13127,  600), -- 卡尔特拉·血喉 <奥特兰克山谷战场军官>
(615006, 15006, 1, 1, 2002.26, -4796.74, 56.8471, 3.00197, 600); -- 迪兹·斯诺班 <阿拉希盆地战场军官>

-- 派雷亚诺 <圣骑士训练师>
UPDATE `creature` SET `position_x`= 1940.23, `position_y`= -4135.53, `position_z`= 41.1522, `orientation`= 3.12425  WHERE `id` = 23128;

-- 奥拉赫宝珠的知识（术士任务）
DELETE FROM `creature_queststarter` WHERE `id` = 3326 AND `quest` = 4967;
REPLACE INTO `creature_queststarter` (`id`, `quest`) VALUES (3326, 4967);

-- 小鬼的要求（术士任务）
DELETE FROM `creature_queststarter` WHERE `id` IN (3324, 3325, 3326, 4564, 5495, 5496) AND `quest`= 8419;
REPLACE INTO `creature_queststarter` (`id`, `quest`) VALUES (3326, 8419);

UPDATE `creature_template` SET `subname` = 'General Goods Merchant'       WHERE `entry` = 3313;  -- 特拉克根 <杂货商人>
UPDATE `creature_template` SET `subname` = 'Guns and Ammo Merchant'       WHERE `entry` = 3322;  -- 卡加 <枪械弹药商>
UPDATE `creature_template` SET `subname` = 'Reagents Vendor'              WHERE `entry` = 3323;  -- 霍苏斯 <材料商>
UPDATE `creature_template` SET `subname` = 'Poison Vendor'                WHERE `entry` = 3334;  -- 雷库尔 <毒药商>
UPDATE `creature_template` SET `subname` = 'Reagents Vendor'              WHERE `entry` = 3335;  -- 哈格鲁斯 <材料商>
UPDATE `creature_template` SET `subname` = 'General Goods Vendor'         WHERE `entry` = 3350;  -- 阿索兰 <杂货商>
UPDATE `creature_template` SET `subname` = 'Reagents Vendor'              WHERE `entry` = 3351;  -- 玛基努斯 <材料商>
UPDATE `creature_template` SET `subname` = 'Blacksmithing Supplier'       WHERE `entry` = 3356;  -- 苏米 <锻造供应商>
UPDATE `creature_template` SET `subname` = 'Mining Supplier'              WHERE `entry` = 3358;  -- 高里纳 <采矿供应商>
UPDATE `creature_template` SET `subname` = 'General Trade Goods Merchant' WHERE `entry` = 3367;  -- 菲利卡 <杂货商人>
UPDATE `creature_template` SET `subname` = 'Cooking Supplier'             WHERE `entry` = 3400;  -- 克森图 <烹饪供应商>
UPDATE `creature_template` SET `subname` = 'General Trade Goods Merchant' WHERE `entry` = 5817;  -- 史穆拉 <杂货商人>
UPDATE `creature_template` SET `subname` = 'King of Darkspear Trolls'     WHERE `entry` = 10540; -- 沃金 <暗矛巨魔之王>
UPDATE `creature_template` SET `subname` = 'Zeppelin Master'              WHERE `entry` = 12136; -- 斯纳尔克 <飞艇管理员>

-- 军团士兵蒂娜
UPDATE `creature_template` SET `subname`= NULL, `npcflag` = 0, `faction` = 85 WHERE `entry` = 12788;
UPDATE `creature_template_locale` SET `Title` = NULL WHERE `entry` = 12788;
DELETE FROM `npc_vendor` WHERE `entry`= 12788; -- 在经典旧世和TBC期间放置在战场中，需要隐藏直到巫妖王之怒

-- 纳兹格雷尔 <萨尔的顾问>
UPDATE `creature_template` SET `npcflag` = 2, `faction` = 29, `gossip_menu_id` = 0 WHERE `entry` = 3230;
UPDATE `creature_template_model` SET `DisplayScale` = 0.7 WHERE `CreatureID` = 3230;

-- 移除平民标记
UPDATE `creature_template` SET `flags_extra` = 0 WHERE `entry` IN (14392, 14720); -- 伦萨克 / 萨鲁法尔大王

SET @Stonehide  := 112793; -- 卫兵布莱恩·石皮 <军官配饰军需官>，经典旧世
SET @Zarg       := 112794; -- 石头守卫扎尔格 <食物和饮料>，经典旧世
SET @Hola       := 112795; -- 一等军士长霍拉麦，经典旧世
SET @Bork       := 112796; -- 狼骑兵波尔克 <坐骑军需官>，经典旧世
SET @Vixton     := 120278; -- 维克斯顿·宾奇维斯 - 第2赛季
SET @Krixel     := 123396; -- 克里希·宾奇维斯 - 第3赛季
SET @Leeni      := 124392; -- 雷尼·"招牌微笑"·斯莫 - 第4赛季

SET @CGUID      := 659000;

UPDATE `creature_template` SET `subname` = 'Officer Accessories Quartermaster' WHERE `entry` = 12793;
UPDATE `creature_template` SET `subname` = 'Weapons Quartermaster'             WHERE `entry` = 12794;
UPDATE `creature_template` SET `subname` = 'Armor Quartermaster'               WHERE `entry` = 12795;
UPDATE `creature_template` SET `subname` = 'Mount Quartermaster'               WHERE `entry` = 12796;
UPDATE `creature_template` SET `subname` = 'Arena Vendor'                      WHERE `entry` = 20278;

UPDATE `creature_template_addon` SET `mount` = 0 WHERE `entry` = 12796;

DELETE FROM `creature` WHERE `guid` IN (125688, 125690, 125694, 125695, 612792, 612793, 612794, 612795, 612796, 612799, 614581, 623396, 623447, 626397, 620278, 626396); -- 清理
DELETE FROM `creature` WHERE `id`  IN (12788, 19850, 32383, 32385, 34036, 34037, 34038, 34058, 34059, 34060);
DELETE FROM `creature` WHERE `guid` BETWEEN @CGUID+1 AND @CGUID+18;
DELETE FROM `creature` WHERE `guid` BETWEEN @CGUID+101 AND @CGUID+118;

REPLACE INTO `creature` (`guid`, `id`, `map`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`) VALUES
--
(@CGUID+101, 12799, 1, 1, 1632.21, -4262.19, 49.027, 3.63029, 430),     -- 巴沙 <配饰军需官>，经典旧世
(@CGUID+102, @Stonehide, 1, 1, 1657.6, -4191.97, 56.383, 4.52365, 180), -- 卫兵布莱恩·石皮 <军官配饰军需官>，经典旧世
(@CGUID+103, 12793, 1, 1, 1672.24, -4206.81, 56.3827, 3.30568, 180),    -- 卫兵布莱恩·石皮 <军官配饰军需官>，TBC
(@CGUID+104, @Zarg, 1, 1, 1641.65, -4197.52, 56.3823, 5.41219, 180),    -- 石头守卫扎尔格 <食物和饮料>，经典旧世
(@CGUID+105, 12794, 1, 1, 1641.65, -4197.52, 56.3823, 5.41219, 180),    -- 石头守卫扎尔格 <武器军需官>，TBC
(@CGUID+106, @Hola, 1, 1, 1673.9, -4216, 56.3826, 2.93578, 180),        -- 一等军士长霍拉麦 <材料商>，经典旧世
(@CGUID+107, 12795, 1, 1, 1673.9, -4216, 56.3826, 2.93578, 180),        -- 一等军士长霍拉麦 <护甲军需官>，TBC
(@CGUID+108, 14581, 1, 1, 1644.52, -4195.26, 56.3826, 5.43078, 180),    -- 雷角中士 <武器军需官>，经典旧世
(@CGUID+109, 26396, 1, 1, 1669.09, -4196.78, 56.4831, 4.10416, 180),    -- 雷角中士 <武器军需官>，TBC
(@CGUID+110, 12792, 1, 1, 1669.78, -4200.1, 56.3815, 3.61023, 180),     -- 潘兰希尔女士 <护甲军需官>，经典旧世
(@CGUID+111, 26397, 1, 1, 1669.78, -4200.1, 56.3815, 3.61023, 180),     -- 潘兰希尔女士 <护甲军需官>，TBC 第1赛季
(@CGUID+112, 23447, 1, 0, 1644.52, -4195.26, 56.3826, 5.43078, 180),    -- 吉恩中士 <护甲军需官>，TBC 第2赛季
(@CGUID+113, 34039, 1, 1, 1669.78, -4200.1, 56.3815, 3.61023, 180),     -- 潘兰希尔女士 <护甲军需官>，TBC 第3赛季
(@CGUID+114, 34040, 1, 1, 1669.78, -4200.1, 56.3815, 3.61023, 180),     -- 潘兰希尔女士 <护甲军需官>，TBC 第4赛季
(@CGUID+115, 12796, 1, 1, 1674.43, -4212.55, 56.3829, 3.00254, 180),    -- 狼骑兵波尔克 <坐骑军需官>，TBC
(@CGUID+116, @Bork, 1, 1, 1674.43, -4212.55, 56.3829, 3.00254, 180),    -- 狼骑兵波尔克 <坐骑军需官>，经典旧世
(@CGUID+117, 19850, 1, 0, 1651.85, -4209.56, 55.5382, 5.61086, 180),    -- 议员阿尔里亚·丹纳塔斯，TBC
(@CGUID+118, 12788, 1, 1, 1650.95, -4212.82, 55.439, 0.182965, 300),    -- 军团士兵蒂娜，TBC

(@CGUID+1, 20278, 1, 0, 1654.25, -4189.82, 56.3825, 4.71787, 180),      -- 维克斯顿·宾奇维斯 <竞技场商人>，TBC 第1赛季
(@CGUID+2, @Vixton, 1, 0, 1654.25, -4189.82, 56.3825, 4.71787, 180),    -- 维克斯顿·宾奇维斯 <竞技场商人>，TBC 第2赛季
(@CGUID+3, 23396, 1, 0, 1660.37, -4190.74, 56.3817, 4.54116, 180),      -- 克里希·宾奇维斯 <竞技场商人>，TBC 第2赛季
(@CGUID+4, 24392, 1, 0, 1654.25, -4189.82, 56.3825, 4.71787, 180),      -- 雷尼·"招牌微笑"·斯莫 <竞技场商人>，TBC 第3赛季
(@CGUID+5, @Krixel, 1, 0, 1660.37, -4190.74, 56.3817, 4.54116, 180),    -- 克里希·宾奇维斯 <竞技场商人>，TBC 第3赛季
(@CGUID+6, @Leeni, 1, 0, 1654.25, -4189.82, 56.3825, 4.71787, 180),     -- 雷尼·"招牌微笑"·斯莫 <竞技场商人>，TBC 第4赛季
(@CGUID+7, 26352, 1, 1, 1660.37, -4190.74, 56.3817, 4.54116, 180),      -- 佐克·托齐维克 <竞技场商人>，TBC 第4赛季

(@CGUID+11, 32383, 1, 1, 1669.09, -4196.78, 56.3827, 4.10416, 180),     -- 雷角中士，巫妖王之怒 第5赛季
(@CGUID+12, 34036, 1, 1, 1669.09, -4196.78, 56.3827, 4.10416, 180),     -- 雷角中士，巫妖王之怒 第6赛季
(@CGUID+13, 34037, 1, 1, 1669.09, -4196.78, 56.3827, 4.10416, 180),     -- 雷角中士，巫妖王之怒 第7赛季
(@CGUID+14, 34038, 1, 1, 1669.09, -4196.78, 56.3827, 4.10416, 180),     -- 雷角中士，巫妖王之怒 第8赛季
(@CGUID+15, 32385, 1, 0, 1673.07, -4201.89, 56.3826, 3.62927, 180),     -- 桃丽丝·沃兰休斯，巫妖王之怒 第5赛季
(@CGUID+16, 34058, 1, 0, 1673.07, -4201.89, 56.3826, 3.62927, 180),     -- 桃丽丝·沃兰休斯，巫妖王之怒 第6赛季
(@CGUID+17, 34059, 1, 0, 1673.07, -4201.89, 56.3826, 3.62927, 180),     -- 桃丽丝·沃兰休斯，巫妖王之怒 第7赛季
(@CGUID+18, 34060, 1, 0, 1673.07, -4201.89, 56.3826, 3.62927, 180);     -- 桃丽丝·沃兰休斯，巫妖王之怒 第8赛季

UPDATE `creature` SET `ScriptName` = 'npc_ipp_tbc_pvp'  WHERE `guid` IN (@CGUID+109); -- 仅TBC期间可见
UPDATE `creature` SET `ScriptName` = 'npc_ipp_pre_tbc'  WHERE `guid` IN (@CGUID+101, @CGUID+102, @CGUID+104, @CGUID+106, @CGUID+108,@CGUID+110,  @CGUID+116); -- 仅经典旧世期间可见
UPDATE `creature` SET `ScriptName` = 'npc_ipp_tbc'      WHERE `guid` IN (@CGUID+103, @CGUID+105, @CGUID+107, @CGUID+115, @CGUID+117, @CGUID+118); -- TBC及巫妖王之怒期间可见

UPDATE `creature` SET `ScriptName` = 'npc_ipp_tbc_S1'   WHERE `guid` IN (@CGUID+1, @CGUID+111);
UPDATE `creature` SET `ScriptName` = 'npc_ipp_tbc_S2'   WHERE `guid` IN (@CGUID+2, @CGUID+3, @CGUID+112);
UPDATE `creature` SET `ScriptName` = 'npc_ipp_tbc_S3'   WHERE `guid` IN (@CGUID+4, @CGUID+5, @CGUID+113);
UPDATE `creature` SET `ScriptName` = 'npc_ipp_tbc_S4'   WHERE `guid` IN (@CGUID+6, @CGUID+7, @CGUID+114);

UPDATE `creature` SET `ScriptName` = 'npc_ipp_wotlk_S5' WHERE `guid` IN (@CGUID+11, @CGUID+15);
UPDATE `creature` SET `ScriptName` = 'npc_ipp_wotlk_S6' WHERE `guid` IN (@CGUID+12, @CGUID+16);
UPDATE `creature` SET `ScriptName` = 'npc_ipp_wotlk_S7' WHERE `guid` IN (@CGUID+13, @CGUID+17);
UPDATE `creature` SET `ScriptName` = 'npc_ipp_wotlk_S8' WHERE `guid` IN (@CGUID+14, @CGUID+18);

/* 在玩家达到对应进度阶段前隐藏部分商人物品 */
DELETE FROM `conditions` WHERE `SourceTypeOrReferenceId` = 23 AND `SourceGroup` IN (12796, 12792, 26397, 14581, 26396) AND `ConditionValue1` IN (66002, 66006, 66008);
REPLACE INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`,
`ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorType`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES
--
(23, 12792, 16485, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的丝质裹足'), -- 法师
(23, 12792, 16487, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的丝质手套'),
(23, 12792, 16489, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的丝质兜帽'),
(23, 12792, 16490, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的丝质短裤'),
(23, 12792, 16491, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的丝质长袍'),
(23, 12792, 16492, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的丝质护肩'),
(23, 12792, 16494, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的龙皮战靴'), -- 德鲁伊
(23, 12792, 16496, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的龙皮护手'),
(23, 12792, 16501, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的龙皮肩甲'),
(23, 12792, 16502, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的龙皮长裤'),
(23, 12792, 16503, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的龙皮头盔'),
(23, 12792, 16504, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的龙皮胸甲'),
(23, 12792, 16498, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的皮甲长靴'), -- 盗贼
(23, 12792, 16499, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的皮甲手套'),
(23, 12792, 16505, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的皮甲胸衣'),
(23, 12792, 16506, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的皮甲罩帽'),
(23, 12792, 16507, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的皮甲衬肩'),
(23, 12792, 16508, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的皮甲腿胄'),
(23, 12792, 16509, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的板甲重靴'), -- 战士
(23, 12792, 16510, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的板甲手套'),
(23, 12792, 16513, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的板甲护胸'),
(23, 12792, 16514, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的板甲重盔'),
(23, 12792, 16515, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的板甲腿铠'),
(23, 12792, 16516, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的板甲肩铠'),
(23, 12792, 16518, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的锁甲重靴'), -- 萨满祭司
(23, 12792, 16519, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的锁甲护手'),
(23, 12792, 16521, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的锁甲盔帽'),
(23, 12792, 16522, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的锁甲护胸'),
(23, 12792, 16523, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的锁甲护腿'),
(23, 12792, 16524, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的锁甲护肩'),
(23, 12792, 16525, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的链甲'), -- 猎人
(23, 12792, 16526, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的链甲盔帽'),
(23, 12792, 16527, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的链甲腿铠'),
(23, 12792, 16528, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的链甲肩铠'),
(23, 12792, 16530, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的链甲护手'),
(23, 12792, 16531, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的链甲战靴'),
(23, 12792, 17570, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的鬼纹罩帽'), -- 术士
(23, 12792, 17571, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的鬼纹长裤'),
(23, 12792, 17572, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售军团士兵的鬼纹长袍'),
(23, 12792, 17573, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的鬼纹护肩'),
(23, 12792, 17576, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的鬼纹软靴'),
(23, 12792, 17577, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的鬼纹手套'),
(23, 12792, 17610, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的绸缎兜帽'), -- 牧师
(23, 12792, 17611, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售百夫长的绸缎长裤'),
(23, 12792, 17612, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售百夫长的绸缎外套'),
(23, 12792, 17613, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售勇士的绸缎护肩'),
(23, 12792, 17616, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的绸缎软靴'),
(23, 12792, 17617, 0, 0, 8, 0, 66006, 0, 0, 1, 0, 0, '', '玩家未完成安其拉进度时，潘兰希尔女士仅出售血卫士的绸缎手套'),
--
(23, 12792, 22860, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的丝质长靴'),
(23, 12792, 22870, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的丝质裹手'),
(23, 12792, 22883, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的丝质护腿'),
(23, 12792, 22886, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的丝质外套'),
(23, 12792, 23263, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的丝质罩帽'),
(23, 12792, 23264, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的丝质衬肩'),
(23, 12792, 22843, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的链甲长靴'),
(23, 12792, 22862, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的链甲手套'),
(23, 12792, 22874, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的链甲护胸'),
(23, 12792, 22875, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的链甲护腿'),
(23, 12792, 23251, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的链甲头盔'),
(23, 12792, 23252, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的链甲护肩'),
(23, 12792, 22852, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的龙皮长靴'),
(23, 12792, 22863, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的龙皮手套'),
(23, 12792, 22877, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的龙皮护胸'),
(23, 12792, 22878, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的龙皮护腿'),
(23, 12792, 23253, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的龙皮盔帽'),
(23, 12792, 23254, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的龙皮护肩'),
(23, 12792, 22855, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的鬼纹长靴'),
(23, 12792, 22865, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的鬼纹裹手'),
(23, 12792, 22881, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的鬼纹护腿'),
(23, 12792, 22884, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的鬼纹外套'),
(23, 12792, 23255, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的鬼纹兜帽'),
(23, 12792, 23256, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的鬼纹肩饰'),
(23, 12792, 22856, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的皮甲重靴'),
(23, 12792, 22864, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的皮甲护手'),
(23, 12792, 22879, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的皮甲护胸'),
(23, 12792, 22880, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的皮甲护腿'),
(23, 12792, 23257, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的皮甲头盔'),
(23, 12792, 23258, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的皮甲护肩'),
(23, 12792, 22857, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的锁甲战靴'),
(23, 12792, 22867, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的锁甲手套'),
(23, 12792, 22876, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的锁甲胸铠'),
(23, 12792, 22887, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的锁甲腿铠'),
(23, 12792, 23259, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的锁甲头盔'),
(23, 12792, 23260, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的锁甲肩铠'),
(23, 12792, 22858, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的板甲战靴'),
(23, 12792, 22868, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的板甲护手'),
(23, 12792, 22872, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的板甲护胸'),
(23, 12792, 22873, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的板甲护腿'),
(23, 12792, 23243, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的板甲护肩'),
(23, 12792, 23244, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的板甲头盔'),
(23, 12792, 22859, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的绸缎长靴'),
(23, 12792, 22869, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售血卫士的绸缎裹手'),
(23, 12792, 22882, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的绸缎护腿'),
(23, 12792, 22885, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售军团士兵的绸缎外套'),
(23, 12792, 23261, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的绸缎头巾'),
(23, 12792, 23262, 0, 0, 8, 0, 66006, 0, 0, 0, 0, 0, '', '玩家完成安其拉进度后，潘兰希尔女士才会出售勇士的绸缎衬肩'),
--
(23, 12792, 16533, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的丝质罩帽'),
(23, 12792, 16534, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的丝质长裤'),
(23, 12792, 16535, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的丝质外衣'),
(23, 12792, 16536, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的丝质披肩'),
(23, 12792, 16539, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的丝质长靴'),
(23, 12792, 16540, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的丝质护手'),
(23, 12792, 16541, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的板甲护胸'),
(23, 12792, 16542, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的板甲头盔'),
(23, 12792, 16543, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的板甲护腿'),
(23, 12792, 16544, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的板甲护肩'),
(23, 12792, 16545, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的板甲战靴'),
(23, 12792, 16548, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的板甲护手'),
(23, 12792, 16549, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的龙皮锁甲'),
(23, 12792, 16550, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的龙皮头盔'),
(23, 12792, 16551, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的龙皮肩饰'),
(23, 12792, 16552, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的龙皮护腿'),
(23, 12792, 16554, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的龙皮战靴'),
(23, 12792, 16555, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的龙皮手套'),
(23, 12792, 16558, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的皮甲战靴'),
(23, 12792, 16560, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的皮甲手套'),
(23, 12792, 16561, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的皮甲头盔'),
(23, 12792, 16562, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的皮甲肩铠'),
(23, 12792, 16563, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的皮甲护胸'),
(23, 12792, 16564, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的皮甲护腿'),
(23, 12792, 16565, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的链甲护胸'),
(23, 12792, 16566, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的链甲头盔'),
(23, 12792, 16567, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的链甲护腿'),
(23, 12792, 16568, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的链甲护肩'),
(23, 12792, 16569, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的链甲战靴'),
(23, 12792, 16571, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的链甲手套'),
(23, 12792, 16573, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的锁甲战靴'),
(23, 12792, 16574, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的锁甲护手'),
(23, 12792, 16577, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的锁甲护胸'),
(23, 12792, 16578, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的锁甲头盔'),
(23, 12792, 16579, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的锁甲护腿'),
(23, 12792, 16580, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的锁甲肩铠'),
(23, 12792, 17586, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的鬼纹长靴'),
(23, 12792, 17588, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的鬼纹手套'),
(23, 12792, 17590, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的鬼纹衬肩'),
(23, 12792, 17591, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的鬼纹罩帽'),
(23, 12792, 17592, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的鬼纹长袍'),
(23, 12792, 17593, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的鬼纹短裤'),
(23, 12792, 17618, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的绸缎长靴'),
(23, 12792, 17620, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的绸缎手套'),
(23, 12792, 17622, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的绸缎衬肩'),
(23, 12792, 17623, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的绸缎罩帽'),
(23, 12792, 17624, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的绸缎长袍'),
(23, 12792, 17625, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的绸缎护腿'),
(23, 12792, 29612, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的板层甲战靴'),
(23, 12792, 29613, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售将军的板层甲手套'),
(23, 12792, 29614, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的板层甲护腿'),
(23, 12792, 29615, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的板层甲护胸'),
(23, 12792, 29616, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的板层甲头盔'),
(23, 12792, 29617, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，潘兰希尔女士不出售督军的板层甲护肩'),
--
(23, 14581, 16345, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军之剑'),
(23, 14581, 18826, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的墙盾'),
(23, 14581, 18828, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的利斧'),
(23, 14581, 18831, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的战斧'),
(23, 14581, 18835, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的弯弓'),
(23, 14581, 18837, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的弩'),
(23, 14581, 18840, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的剃刀'),
(23, 14581, 18844, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的右手爪'),
(23, 14581, 18848, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的锋锐手爪'),
(23, 14581, 18860, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的火枪'),
(23, 14581, 18866, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的大头棒'),
(23, 14581, 18868, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的粉碎之锤'),
(23, 14581, 18871, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的赶猪棒'),
(23, 14581, 18874, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的战斗法杖'),
(23, 14581, 18877, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的巨剑'),
(23, 14581, 23464, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的战斗钉锤'),
(23, 14581, 23465, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的毁灭者'),
(23, 14581, 23466, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的法术之刃'),
(23, 14581, 23467, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的迅捷之刃'),
(23, 14581, 23468, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的毁灭宝典'),
(23, 14581, 23469, 0, 0, 8, 0, 66002, 0, 0, 0, 0, 0, '', '玩家完成奥妮克希亚进度前，雷角中士不出售高阶督军的治愈之书'),
--
(23, 12796, 34129, 0, 0, 8, 0, 66008, 0, 0, 0, 0, 0, '', '玩家完成TBC前置进度前，狼骑兵波尔克不出售迅捷作战陆行鸟');


-- 巫妖王之怒PVP商人
DELETE FROM `creature` WHERE `id` IN
(34043,  -- 潘兰希尔女士 <护甲军需官>
 34063); -- 血卫士扎尔什 <诺森德护甲军需官>

/* NPC伽雷尔 - 移除非经典旧世的战袍 */
DELETE FROM `npc_vendor` WHERE `entry`= 5188 AND `item` IN (15197, 15199, 19031, 19505, 24004, 31773, 31775, 31776, 31777, 31778, 31779, 31780, 31781, 31804, 32445, 32828, 35221);

-- 诺格任务标记修复
UPDATE `creature_template` SET `npcflag` = `npcflag` | 2 WHERE `entry` = 3412;

-- 任务：向巫医尤克里回复
UPDATE `quest_template` SET `LogDescription`   = "Deliver Neeru's Herb Pouch to Witch Doctor Uzer'i in Feralas." WHERE `ID` = 3122;
UPDATE `creature_queststarter` SET `id` = 3216 WHERE `quest` = 3122;

-- 任务：奇怪的要求 - 使用经典旧世NPC
UPDATE `quest_template` SET
`LogDescription`   = "Take the Shrunken Head to Neeru Fireblade in Orgrimmar.",
`QuestDescription` = "Neeru Fireblade in Orgrimmar has what I need to get started here! He has mixed up a concoction that I need for my... well, you'll see.$B$B
                      Off with you now -- to Orgrimmar. Here, take this with you. It's a shrunken head that I promised Neeru in exchange for the herbs.
                      It's the head of some poor dwarf I ventured across in the forest. I'm sure Neeru will be pleased.$B$B
                      You'll find Neeru in the Cleft of Shadow." WHERE `ID` = 3121;

UPDATE `creature_questender`   SET `id` = 3216 WHERE `quest` = 3121;

-- 智能脚本
UPDATE `creature_template` SET `AIName` = 'SmartAI' WHERE `entry` IN (10540, 14720);
DELETE FROM `smart_scripts` WHERE `source_type` = 0 AND `entryorguid` IN (10540, 14720);
REPLACE INTO `smart_scripts` (`entryorguid`, `source_type`, `id`, `link`, `event_type`, `event_phase_mask`, `event_chance`, `event_flags`,
`event_param1`, `event_param2`, `event_param3`, `event_param4`, `event_param5`, `event_param6`,
`action_type`, `action_param1`, `action_param2`, `action_param3`, `action_param4`, `action_param5`, `action_param6`,
`target_type`, `target_param1`, `target_param2`, `target_param3`, `target_param4`, `target_x`, `target_y`, `target_z`, `target_o`, `comment`) VALUES
--
(10540, 0, 0, 0, 4, 0, 100, 1, 0, 0, 0, 0, 0, 0, 4, 5881, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,            '沃金 - 进入战斗 - 播放音效（不重复）'),
--
(14720, 0, 0, 0, 4, 0, 100, 0, 0, 0, 0, 0, 0, 0, 11, 9347, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,           '萨鲁法尔 - 进入战斗 - 施放致死打击触发'),
(14720, 0, 1, 2, 32, 0, 100, 0, 2000, 9999, 0, 0, 0, 0, 11, 26339, 0, 0, 0, 0, 0, 5, 5, 0, 0, 0, 0, 0, 0, 0,   '萨鲁法尔 - 受到高伤害时 - 施放萨鲁法尔之怒'), -- 应为暴击伤害
(14720, 0, 2, 0, 61, 0, 100, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,              '萨鲁法尔 - 施放萨鲁法尔之怒后 - 说台词0'),
(14720, 0, 3, 0, 9, 0, 100, 0, 0, 0, 25000, 25000, 8, 25, 11, 15749, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, '萨鲁法尔 - 8-25码范围内 - 施放盾牌冲锋'),
(14720, 0, 4, 0, 12, 0, 100, 0, 0, 20, 2500, 3500, 0, 0, 11, 7160, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0,   '萨鲁法尔 - 目标生命值0-20%时 - 施放斩杀'),
(14720, 0, 5, 0, 5, 0, 100, 0, 5000, 5000, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,         '萨鲁法尔 - 击杀时 - 说台词1');

DELETE FROM `creature_text` WHERE `CreatureID` IN (14720);
REPLACE INTO `creature_text` (`CreatureID`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextId`, `TextRange`, `comment`) VALUES
(14720, 0, 0, '%s\'s eyes glow red for a brief moment.', 16, 0, 100, 0, 0, 0, 11563, 0, '萨鲁法尔之怒'),
(14720, 1, 0, 'Is that the best you can do?',            16, 0, 100, 0, 0, 0, 11564, 0, '萨鲁法尔击杀台词');
